swt/design_pattern.html
---
layout: page
title: Design_pattern
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Entwurfsmuster</h2>
<div class="outline-text-2" id="text-1">
<p>
Entwurfsmuster:
</p>

<ul class="org-ul">
<li>sind bewährte generische Lösungen für wiederkehrende Entwurfsprobleme
</li>
<li>liefern eine gemeinsame Terminologie zur Kommunikation über
Programmstrukturen
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Erzeugungsmuster</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Enturfsmuster, die dabei Helfen System unabhängig davon zu machen, wie
seine Objekte erzeugt, zusammengesetzt und repräsentiert werden.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Singleton</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Stellt sicher, dass es zur Laufzeit nur eine Instanz einer Klasse gibt
und ermöglicht den Zugriff auf dieses Objekt. Zentrale Aspekte:
</p>

<ul class="org-ul">
<li>''private'' Konstruktor
</li>
<li>Klassenmethode ''getInstance()''
</li>
</ul>

<p>
Einsatzbeispiele:
</p>

<ul class="org-ul">
<li>Synchronisierung des Zugriffs auf gemeinsam genutzte Ressourcen, die
nur einmal zur Verfügung stehen (z.B. Drucker, Netzwerkstack, Webcam)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Abstract Factory</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Zweck: Konsistente Erzeugung mehrerer voneinander abhängiger Objekte
(<i><i>Produktfamilien</i></i>).
</p>

<p>
Vorteile:
</p>

<ul class="org-ul">
<li>einfacher Austausch von Produktfamilien durch Austausch der konkreten
Fabrik
</li>
<li>Konsistenz der erzeugten Objekte (abstrakte Fabrik erzeugt nur
Objekte einer Produktfamilie)
</li>
<li>Code des Client unabhängig von konkreten Produkten (Client greift auf
Produkte nur über deren abstrakte Schnittstelle zu)
</li>
</ul>

<p>
Nachteile:
</p>

<ul class="org-ul">
<li>Unterstützung neuer Produkte aufwendig, wenn dafür die Schnittstelle
der abstrakten Fabrik verändert werden muss (dann müssen in allen
konkreten Fabriken Änderungen vorgenommen werden)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Verhaltensmuster</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Entwurfsmuster für die Interaktion zwischen Objekten und Klassen.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Strategy</h4>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Observer</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Weitergabe von Änderungen an einem Objekt (Modell) an davon abhängige
Objekte (Beobachter).
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Commando</h4>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Memento</h4>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Visitor</h4>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Strukturmuster</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Entwurfsmuster zum Zusammensetzen von Klassen und Objekten zu größeren
Strukturen.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Composite (Kompositum)</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Ermöglicht die Gleichbehandlung von Primitiven und Containern aus
Benutzersicht (keine Unterscheidung zischen Teilen und Gamzem auf Seiten
der Benutzer nötig).
</p>

<p>
Vorteile:
</p>

<ul class="org-ul">
<li>Beherschung der Komplexität (Primitive Objekte können leicht zu
komplexen zusammengesetzt werden)
</li>
<li>Vereinfachung der Implementierung des Clients
</li>
<li>Erweiterbar (neue Container- oder Primitivaklassen können einfach
eingebunden werden)
</li>
</ul>

<p>
Nachteile:
</p>

<ul class="org-ul">
<li>Typen enthaltener Komponeneten müssen zur Luafzeit geprüft werden
</li>
<li>Kompositionen können nicht auf bestimmte Typen von Containern oder
Primitiva beschränkt werden
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Facade</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Fasseadenklasse bietet eine gemeinsame Schnittstelle für eine Menge von
Klassen.
</p>

<ul class="org-ul">
<li>Nachteile:
</li>
<li>Vorteile:

<ul class="org-ul">
<li>führt zu geringerer Kopplung
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Decorator</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Wird verwendet, um Klassen um Eigenschaften und Methoden zu erweitern.
Die Besonderheit besthe darin, dass durch Dekorierer einzelne Attribute
und Methoden einzeln hinzugefügr werden können. Damit können auf
einfache Weise Objekte erzeugt werden, die beliebige Kombinationen
zusätzlicher Operationen und Attribute aufweisen.
</p>

<ul class="org-ul">
<li>Vorteile:

<ul class="org-ul">
<li>Vermeidung langer unübersichtlicher Vererbungshierarchien
</li>
<li>Dekorierer können einem Objekt flexibel hinzugefügt werden und
sogar zur Laufzeit ausgetauscht werden
</li>
</ul>
</li>

<li>Nachteile:

<ul class="org-ul">
<li>Vorsicht bei Verwednung von Vergleichsoperationen
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Weitere Muster</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Model-View-Control (MVC)</h4>
</div>
</div>
</div>
